app/Controllers/Admin.php

    public function nilai_posttest()
{
    $session = session();
    if ($session->has('admin_in') || $session->get('admin_in') === true) {
        $keyword = $this->request->getGet('search');

        $hasilPosttestModel = new \App\Models\HasilPosttestModel();
        $ansPosttestModel = new \App\Models\AnsPosttestModel();
        $posttestModel = new \App\Models\PosttestModel();

        // Ambil semua soal sekali saja (bisa juga per user kalau mau dinamis)
        $soalList = $posttestModel->findAll();
        $soalById = [];
        foreach ($soalList as $soal) {
            $soalById[$soal['id']] = $soal;
        }

        $users = $hasilPosttestModel
            ->select('hasil_posttest.*, user.nama, user.email, user.no_hp, pasien.id as id_pasien')
            ->join('pasien', 'pasien.id = hasil_posttest.id_pasien')
            ->join('user', 'user.id = pasien.id_user')
            ->orderBy('hasil_posttest.id', 'DESC')
            ->findAll();
---
SELECT *
FROM `posttest`
SELECT `hasil_posttest`.*, `user`.`nama`, `user`.`email`, `user`.`no_hp`, `pasien`.`id` as `id_pasien`
FROM `hasil_posttest`
JOIN `pasien` ON `pasien`.`id` = `hasil_posttest`.`id_pasien`
JOIN `user` ON `user`.`id` = `pasien`.`id_user`
ORDER BY `hasil_posttest`.`id` DESC