app/Models/UserModel.php

INSERT INTO `user` (`role`, `nama`, `gender`, `tgl_lahir`, `no_hp`, `email`, `username`, `password`, `foto`) VALUES ('pasien', 'Testing3', 'Laki-laki', '2001-04-30', '085156375966', 'fasf@gmail.com', 'tajali3', '$argon2id$v=19$m=65536,t=4,p=1$SjgvMXdjLzhUbVEuRS5YMA$6u2TkMsT0fJQleK/Ql4GaDXk1hK0CDzlnQUMzhphPzY', 'assets/images/learning/default.jpg')
---
    public function insertData($data)
    {
        return $this->insert($data);

SELECT *
FROM `user`
WHERE `username` = 'tajali3'
 LIMIT 1
---
    public function getID($username)
    {
        return $this->where('username', $username)->first()['id'];

SELECT *
FROM `user`
WHERE `username` = 'tajali3'
 LIMIT 1
---
    public function cekUser($username)
    {
        return $this->where('username', $username)->first() === null;

SELECT *
FROM `user`
WHERE `username` = 'tajali3'
 LIMIT 1
---
    public function getData($username)
    {
        return $this->where('username', $username)->first();

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'dokter'
---
    public function countDoctors()
    {
        return $this->where('role', 'dokter')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'pasien'
---
    public function countPatients()
    {
        return $this->where('role', 'pasien')->countAllResults();